; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport two-cities-sequential-5nodes-1000size-3degree-100mindistance-2trucks-6packages-1291seed

(define (problem transport-two-cities-sequential-5nodes-1000size-3degree-100mindistance-2trucks-6packages-1291seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  city-1-loc-5 - location
  city-2-loc-5 - location
  truck-1 - vehicle
  truck-2 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  package-5 - package
  package-6 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 396,595 -> 586,858
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 33)
  ; 586,858 -> 396,595
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 33)
  ; 802,433 -> 586,858
  (road city-1-loc-4 city-1-loc-1)
  (= (road-length city-1-loc-4 city-1-loc-1) 48)
  ; 586,858 -> 802,433
  (road city-1-loc-1 city-1-loc-4)
  (= (road-length city-1-loc-1 city-1-loc-4) 48)
  ; 802,433 -> 396,595
  (road city-1-loc-4 city-1-loc-2)
  (= (road-length city-1-loc-4 city-1-loc-2) 44)
  ; 396,595 -> 802,433
  (road city-1-loc-2 city-1-loc-4)
  (= (road-length city-1-loc-2 city-1-loc-4) 44)
  ; 802,433 -> 826,154
  (road city-1-loc-4 city-1-loc-3)
  (= (road-length city-1-loc-4 city-1-loc-3) 28)
  ; 826,154 -> 802,433
  (road city-1-loc-3 city-1-loc-4)
  (= (road-length city-1-loc-3 city-1-loc-4) 28)
  ; 171,385 -> 396,595
  (road city-1-loc-5 city-1-loc-2)
  (= (road-length city-1-loc-5 city-1-loc-2) 31)
  ; 396,595 -> 171,385
  (road city-1-loc-2 city-1-loc-5)
  (= (road-length city-1-loc-2 city-1-loc-5) 31)
  ; 2497,940 -> 2212,942
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 29)
  ; 2212,942 -> 2497,940
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 29)
  ; 2157,430 -> 2212,942
  (road city-2-loc-3 city-2-loc-1)
  (= (road-length city-2-loc-3 city-2-loc-1) 52)
  ; 2212,942 -> 2157,430
  (road city-2-loc-1 city-2-loc-3)
  (= (road-length city-2-loc-1 city-2-loc-3) 52)
  ; 2706,546 -> 2497,940
  (road city-2-loc-5 city-2-loc-2)
  (= (road-length city-2-loc-5 city-2-loc-2) 45)
  ; 2497,940 -> 2706,546
  (road city-2-loc-2 city-2-loc-5)
  (= (road-length city-2-loc-2 city-2-loc-5) 45)
  ; 2706,546 -> 2948,229
  (road city-2-loc-5 city-2-loc-4)
  (= (road-length city-2-loc-5 city-2-loc-4) 40)
  ; 2948,229 -> 2706,546
  (road city-2-loc-4 city-2-loc-5)
  (= (road-length city-2-loc-4 city-2-loc-5) 40)
  ; 802,433 <-> 2157,430
  (road city-1-loc-4 city-2-loc-3)
  (= (road-length city-1-loc-4 city-2-loc-3) 136)
  (road city-2-loc-3 city-1-loc-4)
  (= (road-length city-2-loc-3 city-1-loc-4) 136)
  (at package-1 city-1-loc-1)
  (at package-2 city-1-loc-1)
  (at package-3 city-1-loc-2)
  (at package-4 city-1-loc-3)
  (at package-5 city-1-loc-2)
  (at package-6 city-1-loc-2)
  (at truck-1 city-2-loc-4)
  (capacity truck-1 capacity-2)
  (at truck-2 city-2-loc-2)
  (capacity truck-2 capacity-4)
 )
 (:goal (and
  (at package-1 city-2-loc-5)
  (at package-2 city-2-loc-5)
  (at package-3 city-2-loc-1)
  (at package-4 city-2-loc-2)
  (at package-5 city-2-loc-3)
  (at package-6 city-2-loc-5)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-2 city-2-loc-2 city-2-loc-1)
   deleted: (at truck-2 city-2-loc-2)
   added: (at truck-2 city-2-loc-1)
   goals met: 0 of 6
2. (drive truck-2 city-2-loc-1 city-2-loc-3)
   deleted: (at truck-2 city-2-loc-1)
   added: (at truck-2 city-2-loc-3)
   goals met: 0 of 6
3. (drive truck-2 city-2-loc-3 city-1-loc-4)
   deleted: (at truck-2 city-2-loc-3)
   added: (at truck-2 city-1-loc-4)
   goals met: 0 of 6
4. (drive truck-2 city-1-loc-4 city-1-loc-2)
   deleted: (at truck-2 city-1-loc-4)
   added: (at truck-2 city-1-loc-2)
   goals met: 0 of 6
5. (pick-up truck-2 city-1-loc-2 package-6 capacity-3 capacity-4)
   deleted: (at package-6 city-1-loc-2) (capacity truck-2 capacity-4)
   added: (in package-6 truck-2) (capacity truck-2 capacity-3)
   goals met: 0 of 6
6. (pick-up truck-2 city-1-loc-2 package-5 capacity-2 capacity-3)
   deleted: (at package-5 city-1-loc-2) (capacity truck-2 capacity-3)
   added: (in package-5 truck-2) (capacity truck-2 capacity-2)
   goals met: 0 of 6
7. (pick-up truck-2 city-1-loc-2 package-3 capacity-1 capacity-2)
   deleted: (at package-3 city-1-loc-2) (capacity truck-2 capacity-2)
   added: (in package-3 truck-2) (capacity truck-2 capacity-1)
   goals met: 0 of 6
8. (drive truck-2 city-1-loc-2 city-1-loc-4)
   deleted: (at truck-2 city-1-loc-2)
   added: (at truck-2 city-1-loc-4)
   goals met: 0 of 6
9. (drive truck-2 city-1-loc-4 city-2-loc-3)
   deleted: (at truck-2 city-1-loc-4)
   added: (at truck-2 city-2-loc-3)
   goals met: 0 of 6
10. (drop truck-2 city-2-loc-3 package-5 capacity-1 capacity-2)
   deleted: (in package-5 truck-2) (capacity truck-2 capacity-1)
   added: (at package-5 city-2-loc-3) (capacity truck-2 capacity-2)
   goals met: 1 of 6
11. (drive truck-2 city-2-loc-3 city-2-loc-1)
   deleted: (at truck-2 city-2-loc-3)
   added: (at truck-2 city-2-loc-1)
   goals met: 1 of 6
12. (drop truck-2 city-2-loc-1 package-3 capacity-2 capacity-3)
   deleted: (in package-3 truck-2) (capacity truck-2 capacity-2)
   added: (at package-3 city-2-loc-1) (capacity truck-2 capacity-3)
   goals met: 2 of 6
13. (drive truck-2 city-2-loc-1 city-2-loc-3)
   deleted: (at truck-2 city-2-loc-1)
   added: (at truck-2 city-2-loc-3)
   goals met: 2 of 6
14. (drive truck-2 city-2-loc-3 city-1-loc-4)
   deleted: (at truck-2 city-2-loc-3)
   added: (at truck-2 city-1-loc-4)
   goals met: 2 of 6
15. (drive truck-2 city-1-loc-4 city-1-loc-3)
   deleted: (at truck-2 city-1-loc-4)
   added: (at truck-2 city-1-loc-3)
   goals met: 2 of 6
16. (pick-up truck-2 city-1-loc-3 package-4 capacity-2 capacity-3)
   deleted: (at package-4 city-1-loc-3) (capacity truck-2 capacity-3)
   added: (in package-4 truck-2) (capacity truck-2 capacity-2)
   goals met: 2 of 6
17. (drive truck-2 city-1-loc-3 city-1-loc-4)
   deleted: (at truck-2 city-1-loc-3)
   added: (at truck-2 city-1-loc-4)
   goals met: 2 of 6
18. (drive truck-2 city-1-loc-4 city-1-loc-1)
   deleted: (at truck-2 city-1-loc-4)
   added: (at truck-2 city-1-loc-1)
   goals met: 2 of 6
19. (pick-up truck-2 city-1-loc-1 package-2 capacity-1 capacity-2)
   deleted: (at package-2 city-1-loc-1) (capacity truck-2 capacity-2)
   added: (in package-2 truck-2) (capacity truck-2 capacity-1)
   goals met: 2 of 6
20. (pick-up truck-2 city-1-loc-1 package-1 capacity-0 capacity-1)
   deleted: (at package-1 city-1-loc-1) (capacity truck-2 capacity-1)
   added: (in package-1 truck-2) (capacity truck-2 capacity-0)
   goals met: 2 of 6
21. (drive truck-2 city-1-loc-1 city-1-loc-4)
   deleted: (at truck-2 city-1-loc-1)
   added: (at truck-2 city-1-loc-4)
   goals met: 2 of 6
22. (drive truck-2 city-1-loc-4 city-2-loc-3)
   deleted: (at truck-2 city-1-loc-4)
   added: (at truck-2 city-2-loc-3)
   goals met: 2 of 6
23. (drive truck-2 city-2-loc-3 city-2-loc-1)
   deleted: (at truck-2 city-2-loc-3)
   added: (at truck-2 city-2-loc-1)
   goals met: 2 of 6
24. (drive truck-2 city-2-loc-1 city-2-loc-2)
   deleted: (at truck-2 city-2-loc-1)
   added: (at truck-2 city-2-loc-2)
   goals met: 2 of 6
25. (drop truck-2 city-2-loc-2 package-4 capacity-0 capacity-1)
   deleted: (in package-4 truck-2) (capacity truck-2 capacity-0)
   added: (at package-4 city-2-loc-2) (capacity truck-2 capacity-1)
   goals met: 3 of 6
26. (drive truck-2 city-2-loc-2 city-2-loc-5)
   deleted: (at truck-2 city-2-loc-2)
   added: (at truck-2 city-2-loc-5)
   goals met: 3 of 6
27. (drop truck-2 city-2-loc-5 package-1 capacity-1 capacity-2)
   deleted: (in package-1 truck-2) (capacity truck-2 capacity-1)
   added: (at package-1 city-2-loc-5) (capacity truck-2 capacity-2)
   goals met: 4 of 6
28. (drop truck-2 city-2-loc-5 package-2 capacity-2 capacity-3)
   deleted: (in package-2 truck-2) (capacity truck-2 capacity-2)
   added: (at package-2 city-2-loc-5) (capacity truck-2 capacity-3)
   goals met: 5 of 6
29. (drop truck-2 city-2-loc-5 package-6 capacity-3 capacity-4)
   deleted: (in package-6 truck-2) (capacity truck-2 capacity-3)
   added: (at package-6 city-2-loc-5) (capacity truck-2 capacity-4)
   goals met: 6 of 6
